[
  {
    "id": 1,
    "title": "Welcome Back to School Year 2026!",
    "slug": "welcome-back-school-year-2026",
    "excerpt": "We're excited to welcome all students and families back for another amazing year of learning and growth at Tag-os Elementary School.",
    "content": "<p>The Southern Luzon State University was one of the awardees for the 2025 Sipag, Galing, Liksi, at Alaab (SIGLA) Awards hosted by the Department of Social Welfare and Development Field Office IV-A.</p><p>The SIGLA award recognized SLSU's outstanding contributions, innovative practices, and impactful collaborations in support of the DSWD's efforts in delivering community services. The university was specifically cited for its significant role in advancing the Pantawid Pamilyang Pilipino Program (4Ps) in Quezon Province through capacity-building initiatives, extension programs, and academic support.</p><p>The ceremony took place in Sta. Cruz, Manila, January 13, with the following SLSU representatives: Dr. Marissa C. Esperal, Vice President for Research, Extension, Production, Development, and Innovation; Dr. Felino J. Gutierrez, Jr., Director of the Office of Extension Services; and Mr. Ryan A. Alcoreza, a technical staff member from the same office.</p>",
    "image_url": "https://picsum.photos/1200/800?random=1",
    "source": "School Administration",
    "author": "Principal Maria Santos",
    "published_at": "2026-02-01T08:00:00Z",
    "is_published": true,
    "order_index": 1
  },
  {
    "id": 2,
    "title": "Science Fair 2026: Young Innovators Showcase",
    "slug": "science-fair-2026-young-innovators",
    "excerpt": "Annual Science Fair returns with exciting projects from our talented students. Registration now open for all grade levels.",
    "content": "<p>Tag-os Elementary School is proud to announce the return of our annual Science Fair, scheduled for March 15, 2026. This year's theme is 'Innovation for a Sustainable Future,' encouraging students to explore solutions to environmental challenges.</p><p>Students from all grade levels are invited to participate by registering their projects starting next week. The fair will feature categories including Life Sciences, Physical Sciences, Environmental Studies, and Technology & Engineering.</p><p>Winners will receive medals, certificates, and special recognition at our year-end awards ceremony. Additionally, top projects will be featured in our school newsletter and website.</p><p>For registration details and project guidelines, please contact the Science Department or visit the school office.</p>",
    "image_url": "https://picsum.photos/1200/800?random=2",
    "source": "Science Department",
    "author": "Ms. Elena Rodriguez",
    "published_at": "2026-01-28T10:00:00Z",
    "is_published": true,
    "order_index": 2
  },
  {
    "id": 3,
    "title": "Parent-Teacher Conference: Building Stronger Partnerships",
    "slug": "parent-teacher-conference-2026",
    "excerpt": "Join us for our quarterly parent-teacher conference to discuss student progress and strengthen our school community.",
    "content": "<p>We cordially invite all parents and guardians to our upcoming Parent-Teacher Conference scheduled for February 20-21, 2026. This is an excellent opportunity to meet with your child's teachers, review academic progress, and discuss ways to support learning at home.</p><p>Conference slots are available from 8:00 AM to 5:00 PM on both days. Please schedule your appointment through our online booking system or by calling the school office at (123) 456-7890.</p><p>During the conference, teachers will share:</p><ul><li>Academic performance and progress reports</li><li>Behavioral observations and social development</li><li>Recommendations for continued growth</li><li>Answers to your questions and concerns</li></ul><p>We look forward to partnering with you in your child's educational journey!</p>",
    "image_url": "https://picsum.photos/1200/800?random=3",
    "source": "Guidance Office",
    "author": "Ms. Carmen Reyes",
    "published_at": "2026-01-25T09:00:00Z",
    "is_published": true,
    "order_index": 3
  },
  {
    "id": 4,
    "title": "Reading Month Celebration: Fostering Love for Books",
    "slug": "reading-month-celebration-2026",
    "excerpt": "February is Reading Month! Join our exciting activities including book fairs, storytelling sessions, and reading challenges.",
    "content": "<p>Tag-os Elementary School celebrates Reading Month throughout February with a series of engaging activities designed to inspire a lifelong love of reading in our students.</p><p><strong>Scheduled Activities:</strong></p><ul><li><strong>Book Fair</strong> - February 5-7: Browse and purchase books from various genres</li><li><strong>Author Visit</strong> - February 12: Meet local children's book author Juan dela Cruz</li><li><strong>Storytelling Sessions</strong> - Every Friday: Interactive read-aloud sessions in the library</li><li><strong>Reading Challenge</strong> - All month: Track your reading and win prizes!</li><li><strong>Dress as Your Favorite Character Day</strong> - February 28: Show your book spirit!</li></ul><p>The library will also feature special displays, recommended reading lists, and extended hours during Reading Month. Let's make this a month to remember!</p>",
    "image_url": "https://picsum.photos/1200/800?random=4",
    "source": "Library Services",
    "author": "Ms. Sofia Martinez",
    "published_at": "2026-01-22T11:00:00Z",
    "is_published": true,
    "order_index": 4
  },
  {
    "id": 5,
    "title": "Sports Day 2026: Celebrating Teamwork and Sportsmanship",
    "slug": "sports-day-2026-teamwork-sportsmanship",
    "excerpt": "Get ready for our annual Sports Day! Students will compete in various athletic events promoting fitness and fair play.",
    "content": "<p>Mark your calendars for Sports Day 2026, scheduled for March 8! This annual event brings together students, teachers, and families for a day of athletic competition, team spirit, and fun.</p><p><strong>Event Schedule:</strong></p><ul><li>8:00 AM - Opening Ceremony and Parade of Athletes</li><li>9:00 AM - Track and Field Events (100m dash, relay races, long jump)</li><li>11:00 AM - Team Sports (basketball, volleyball, tug-of-war)</li><li>1:00 PM - Fun Games and Activities</li><li>3:00 PM - Awards Ceremony and Closing</li></ul><p>All students are encouraged to participate. Parents and guardians are welcome to attend and cheer for their young athletes. Food stalls and refreshments will be available throughout the day.</p><p>Let's celebrate the values of teamwork, perseverance, and sportsmanship together!</p>",
    "image_url": "https://picsum.photos/1200/800?random=5",
    "source": "Physical Education Department",
    "author": "Coach Miguel Torres",
    "published_at": "2026-01-20T08:30:00Z",
    "is_published": true,
    "order_index": 5
  },
  {
    "id": 6,
    "title": "Arts and Culture Week: Celebrating Creativity",
    "slug": "arts-culture-week-2026",
    "excerpt": "Experience the talents of our students during Arts and Culture Week featuring performances, exhibitions, and workshops.",
    "content": "<p>Tag-os Elementary School proudly presents Arts and Culture Week from February 10-14, 2026. This special week showcases the incredible artistic talents of our students across various disciplines.</p><p><strong>Week Highlights:</strong></p><ul><li><strong>Monday</strong> - Visual Arts Exhibition: Student artwork displayed in the main hall</li><li><strong>Tuesday</strong> - Music Concert: Choir and instrumental performances</li><li><strong>Wednesday</strong> - Dance Showcase: Traditional and modern dance presentations</li><li><strong>Thursday</strong> - Drama Performance: Student theater production</li><li><strong>Friday</strong> - Cultural Fair: Celebrate diversity with food, music, and traditions</li></ul><p>All events are free and open to the school community. Join us in celebrating the creativity and cultural richness of Tag-os Elementary School!</p>",
    "image_url": "https://picsum.photos/1200/800?random=6",
    "source": "Arts Department",
    "author": "Ms. Isabella Cruz",
    "published_at": "2026-01-18T10:00:00Z",
    "is_published": true,
    "order_index": 6
  },
  {
    "id": 7,
    "title": "Environmental Awareness Campaign: Green School Initiative",
    "slug": "environmental-awareness-green-school",
    "excerpt": "Join our Green School Initiative promoting sustainability, recycling, and environmental stewardship among students.",
    "content": "<p>Tag-os Elementary School launches its Green School Initiative, a comprehensive environmental awareness campaign aimed at creating a more sustainable campus and fostering eco-conscious citizens.</p><p><strong>Initiative Components:</strong></p><ul><li><strong>Recycling Program</strong> - Color-coded bins for paper, plastic, and organic waste</li><li><strong>School Garden</strong> - Students learn about sustainable agriculture and grow vegetables</li><li><strong>Energy Conservation</strong> - Classroom monitors ensure lights and equipment are turned off</li><li><strong>Tree Planting</strong> - Monthly tree-planting activities around campus</li><li><strong>Eco-Workshops</strong> - Learn about climate change, conservation, and green living</li></ul><p>Every student can make a difference! Let's work together to protect our planet for future generations.</p>",
    "image_url": "https://picsum.photos/1200/800?random=7",
    "source": "Environmental Club",
    "author": "Mr. Roberto Fernandez",
    "published_at": "2026-01-15T09:00:00Z",
    "is_published": true,
    "order_index": 7
  },
  {
    "id": 8,
    "title": "Technology Integration: New Computer Lab Opens",
    "slug": "new-computer-lab-technology-integration",
    "excerpt": "State-of-the-art computer lab now open, providing students with modern technology for enhanced learning experiences.",
    "content": "<p>We are thrilled to announce the opening of our new state-of-the-art computer laboratory, equipped with 40 modern computers, interactive displays, and high-speed internet connectivity.</p><p><strong>Lab Features:</strong></p><ul><li>Latest desktop computers with educational software</li><li>Interactive whiteboard for demonstrations</li><li>Coding and programming tools for young learners</li><li>Safe, filtered internet access</li><li>Comfortable, ergonomic workstations</li></ul><p>The computer lab will be integrated into our curriculum across all grade levels, with dedicated class time for computer literacy, coding basics, digital citizenship, and research skills.</p><p>Special thanks to our generous donors and the PTA for making this facility possible. We're excited to prepare our students for the digital future!</p>",
    "image_url": "https://picsum.photos/1200/800?random=8",
    "source": "Technology Department",
    "author": "Mr. Daniel Aquino",
    "published_at": "2026-01-12T11:00:00Z",
    "is_published": true,
    "order_index": 8
  },
  {
    "id": 9,
    "title": "Community Outreach: Feeding Program Success",
    "slug": "community-outreach-feeding-program",
    "excerpt": "Our school feeding program reaches milestone, providing nutritious meals to hundreds of students daily.",
    "content": "<p>Tag-os Elementary School's feeding program has successfully provided over 10,000 nutritious meals to students since its launch last year, significantly improving student health and academic performance.</p><p><strong>Program Highlights:</strong></p><ul><li>Daily breakfast and lunch for identified beneficiaries</li><li>Balanced, nutritious meals prepared by trained staff</li><li>Nutrition education for students and parents</li><li>Regular health monitoring and assessment</li><li>Partnership with local farmers for fresh ingredients</li></ul><p>Studies show that students in the program have improved attendance, better concentration, and enhanced academic performance. The program is made possible through partnerships with local government, NGOs, and generous community donors.</p><p>Thank you to everyone who supports this vital initiative!</p>",
    "image_url": "https://picsum.photos/1200/800?random=9",
    "source": "Community Relations",
    "author": "Ms. Grace Villanueva",
    "published_at": "2026-01-10T08:00:00Z",
    "is_published": true,
    "order_index": 9
  }
]
